In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    'first' : ['Corey',"Jane",'John','Chris',np.nan,None,'NA'],
    'last' : ['Schafer','Doe','Doe',np.nan,np.nan,None,'Missing'],
    'email' : ['CoreyMSchafer@gmail.com','JaneDoe@gmail.com','JhonDoe@gmail.com',None,np.nan, 'Anonymous@email.com', 'NA'],
    'age' : ['33','55','63','36',None,None,"Missing"]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@gmail.com       55
2   John      Doe        JhonDoe@gmail.com       63
3  Chris      NaN                     None       36
4    NaN      NaN                      NaN     None
5   None     None      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [5]:
df.dropna()

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@gmail.com       55
2   John      Doe        JhonDoe@gmail.com       63
6     NA  Missing                       NA  Missing

In [6]:
df.dropna(axis='index',how='any')  ## default

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@gmail.com       55
2   John      Doe        JhonDoe@gmail.com       63
6     NA  Missing                       NA  Missing

In [7]:
df.dropna(axis='index',how='all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@gmail.com       55
2   John      Doe        JhonDoe@gmail.com       63
3  Chris      NaN                     None       36
5   None     None      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [8]:
df.dropna(axis='columns',how='all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@gmail.com       55
2   John      Doe        JhonDoe@gmail.com       63
3  Chris      NaN                     None       36
4    NaN      NaN                      NaN     None
5   None     None      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [9]:
df.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [10]:
df.dropna(axis='index',how='any',subset=['email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@gmail.com       55
2   John      Doe        JhonDoe@gmail.com       63
5   None     None      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [11]:
df.dropna(axis='index',how='any',subset=['last','email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@gmail.com       55
2   John      Doe        JhonDoe@gmail.com       63
6     NA  Missing                       NA  Missing

In [12]:
df.dropna(axis='index',how='all',subset=['last','email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@gmail.com       55
2   John      Doe        JhonDoe@gmail.com       63
5   None     None      Anonymous@email.com     None
6     NA  Missing                       NA  Missing